In [1]:
import pandas as pd

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
df["c1"]

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [5]:
df[["c1"]]

    c1
l1   1
l2   5
l3   8
l4  13

In [6]:
df[["c1", "c3"]]

    c1  c3
l1   1   3
l2   5   7
l3   8  11
l4  13  15

In [7]:
df.loc["l1"]

c1    1
c2    2
c3    3
c4    4
Name: l1, dtype: int64

In [8]:
df.loc[["l1", "l3"]]

    c1  c2  c3  c4
l1   1   2   3   4
l3   8  10  11  12

In [9]:
df.loc["l1", "c1"]

1

In [11]:
df.iloc[2, 2]

11

In [12]:
df.loc[["l2", "l4"], ["c1", "c3"]]

    c1  c3
l2   5   7
l4  13  15

In [13]:
df.iloc[[1, 3], [0, 2]]

    c1  c3
l2   5   7
l4  13  15

In [14]:
df.iloc[[3, 1], [0, 2]]

    c1  c3
l4  13  15
l2   5   7